---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.ChildrenDeletedOnGroupSwap
source: html/60dddf63-0c10-1416-2b87-06fe15410376.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.ChildrenDeletedOnGroupSwap Property

Some dependent elements were deleted by changing group type and cannot be retained.

## Syntax (C#)
```csharp
public static FailureDefinitionId ChildrenDeletedOnGroupSwap { get; }
```